---
type: GeometryObject
namespace: Autodesk.Revit.DB
version: 2024
members: 6
tags: [revit-api, class]
---

# GeometryObject

`Autodesk.Revit.DB.GeometryObject` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Equals | — | `public override bool Equals ( Object obj )` |
| Method | GetHashCode | — | `public override int GetHashCode ()` |
| Property | GraphicsStyleId | 2012 | `public ElementId GraphicsStyleId { get ; }` |
| Property | Id | 2021 | `public int Id { get ; }` |
| Property | IsElementGeometry | 2012 | `public bool IsElementGeometry { get ; }` |
| Property | Visibility | — | `public Visibility Visibility { get ; set ; }` |